<script setup lang="ts">
import { 
  ref,
  computed,
  onBeforeMount
} from "vue";

import { useRouter } from 'vue-router';

import button from "@/assets/images/icons/btn-understand.svg"
import buttonHover from "@/assets/images/icons/btn-understand-hover.svg"

const router = useRouter()

const isHover = ref(false)

const image = computed(() => {
  return isHover.value ? buttonHover : button
})

function goToMainPage () {
  router.push("/");
}

function downloadFiles () {
  alert("Файлы будут доступны с 12 июля 20.00");
}

function goToHome () {
  router.push("/");
}

onBeforeMount(() => {
  window.scrollTo({ top: 0 });
})
</script>

<template>
  <div class="details">
    <div class="content">
      <div class="wrapper">
        <div class="content__image">
          <img src="../assets/images/icons/rhombus.png" class="rhombus-icon" />
        </div>

        <div class="content__text">
          <div class="text__item">
            <span>
             <b>Когда и откуда стартуем? </b> Дата проведения: <b>14-16 июля,</b> старт <b>гонки 15 июля в 7:00</b>
              <br>
              Участники прибывают в лагерь <b>14 июля</b> начиная <b>с 16.00.</b>
            </span>
          </div>

          <br />

          <div class="text__item">
            <span>
              <b>Что взять с собой на гонку?</b> <br />1. Шлем. Обязательно!
              <br />2. Базовые инструменты, чтобы вы могли, например,
              отремонтировать пробитое колесо. <br />3. Телефон с GPS
              навигатором и установленными программами для загрузки gps трека
              (MapsMe, Osmond) <br />4. Исправный и заряженный пауэрбанк.
              <br />5. Репеллент от клещей, комаров и мошки. Лучше не игнорируй
              этот момент. <br />6. Фонарь. <br />7. Палатку, спальник, еду,
              алкоголь - они вам понадобятся в лагере.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span><b>Насколько сложный маршрут?</b><br /> </span>
          </div>

          <div class="text__item">
            <span>
              Общая дистанция более 100 километров. Маршрут 2023 года, будет более скоростным, но также останутся техничные спуски и подъемы с большим уклоном в самом начале вас будет ждать живописный, но сложный таежный участок, который перейдет в гравийно-полевые участки. Набор высоты на дистанции будет больше 1 километра, стоит это учитывать. Участки с травой выше человеческого роста исключены из гонки.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span>
              <b>
                Что значит "мультиформатная", кто может участвовать?
              </b>
              <br>
              
              Мы видим следующие категории для участников:
              <br>
              <b>Road –</b> Любые велосипеды с колесами 700c и рулем бараном.
              <br>
              <br>
              <b>MTB –</b> Любые MTB велосипеды.
              <br>
              <br>
              <b>Fixed/Single -</b> Любые велосипеды с фиксированной или одной передачей. Размер колес не имеет значения
            </span>
          </div>

          <br />

          <div class="text__item">
            <span
            ><b>А на фиксе проеду?</b> <br />Проедешь, но попотеть придется.
              Можно и на 25 покрышках, но для твоего спокойствия, поставь что-то в районе 35. Соотношение в районе 42x17 будет более чем достаточно.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span
            ><b>А кормить будут?</b> <br />Будет точка питания на маршруте, а
              также карта с указанием источников воды.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span
            ><b
            >Если я не велосипедист, могу ли я приехать в лагерь с друзьями?
              </b>
              <br />
              Да, конечно, мы будем вам рады. Тем более, что в лагере 16 июля будет концерт групп:
              <a href="https://vk.com/olshanoe_band" target="_blank">Olshanoe</a>, 
              <a href="https://vk.com/lesilencedelame" target="_blank">Молчание моря</a> и
              <a href="https://vk.com/dragonsbloodofficial" target="_blank">Драконья кровь</a>.
              О месте проведения, мы расскажем за 3 дня до мероприятия, следите за обновлениями в
              <a href="https://vk.com/urochishche2023" target="_blank">группе</a>
              , а так же в <a href="https://t.me/vglukhomani" target="_blank">Телеграм</a> канале.
              Физический билет на концерт можно взять в нашей <a href="https://vk.com/urochishche2023" target="_blank">группе</a>,
              стоимость 600 рублей. В день концерта билеты по 750 рублей (Принимаем только наличные)
            </span>
          </div>

          <br />

          <div class="text__item">
            <span
            ><b>Что по насекомым? </b>
              <br />
              В Сибири, вдали от городов, все теплокровные в пищевой цепи стоят
              на ступень ниже кровососущих. Насекомые есть - в основном это
              комары и мошка. Есть клещи, но к июлю их активность резко идет на
              спад. Чтобы обезопасить себя и просто сделать свое пребывание в
              лагере комфортным, настоятельно рекомендуем брать репеллент,
              например, синий Рефтамид. Не заходите глубоко в лес и держитесь
              ближе к костру.
            </span>
          </div>

          <div class="content__image">
            <img
                src="../assets/images/icons/rhombus.png"
                class="rhombus-icon"
            />
          </div>

          <div class="text__item">
            <span
            ><b>Навигация и безопасность.</b>
              <br />
              На странице нашей <a href="https://vk.com/urochishche2023" target="_blank">группы</a>
              , а так же в <a href="https://t.me/vglukhomani" target="_blank">Телеграм</a> канале и 
              <a href="https://t.me/Urochishe2022" target="_blank">чате</a>
               для участников, за три дня до гонки, можно будет скачать геоданные с разметкой маршрута, природными достопримечательностями, источниками питьевой воды. На случай, если во время гонки сел телефон или нет сигнала, мы выдадим вам бумажную копию карты на старте (там же будут указаны номера телефонов организаторов).
Во время гонки, по участкам маршрута, где возможен и разрешен проезд, будет курсировать машина сопровождения. В случае каких-то экстренных ситуаций, вам нужно обозначить свое местоположение, и мы скоординируем вашу эвакуацию. Главное доберитесь до места где есть сотовая связь и сообщите о своей проблеме. Если вы участник и видите, что кто-то попал в беду, обязательно помогите или сообщите организаторам.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span
            ><b>Лагерь.</b>
              <br />
              В этом году мы хотим видеть большой и красивый лагерь, но без вашей помощи, мы не сможем сделать по-настоящему крутое место, пожалуйста украшайте места своих стоянок, помогите нам создать не забываемую атмосферу лесного праздника, вы знаете наш стиль.
              <br>
              <br>
              А для того, чтобы эти дни запомнились вам на долго, после гонки пройдет концерт групп групп:
              <a href="https://vk.com/olshanoe_band" target="_blank">Olshanoe</a>, 
              <a href="https://vk.com/lesilencedelame" target="_blank">Молчание моря</a> и 
              <a href="https://vk.com/dragonsbloodofficial" target="_blank">Драконья кровь</a>.
              <br>
              <br>
              Помимо музыки, мы готовим для вас несколько лекций, об истории, нашем крае и природе. Полный список развлечений будет доступен ближе к гонке. Следите за обновлениями в группе.
              <br>
              <br>
              В лагере будет устроен централизованный костер. Свои костры разжигать категорически нельзя! Хотите что-то приготовить, пользуйтесь тем, что есть или газовой горелкой.
В лагере будет оборудован туалет.
              <br>
              Мусорные мешки на территории лагеря в неограниченном количестве. Мы очень надеемся на вашу сознательность в этом вопросе. Если мы заметим, что вы мусорите, даже если вы просто бросили окурок на землю, мы попросим вас покинуть лагерь. Если вы - сторонник философии "все равно сгниет", мы вам не рады.
              <br>
              Единственное, что вам понадобится в лагере, - это собственная палатка, спальный мешок, коврик и средства личной гигиены и посуда.
              <br>
              Если у вас нет палатки, вы забыли ее или потеряли, сообщите заранее - у нас найдется несколько запасных.
              <br>
              Еду на все три дня вы привозите с собой. Питьевая вода в лагере в не ограниченном количестве.
              <br>
              Если по каким-то причинам вы захотите покинуть лагерь, пожалуйста, сообщите кому-то из организаторов, чтобы мы не теряли вас.
            </span>
          </div>

          <div class="content__image">
            <img
                src="../assets/images/icons/rhombus.png"
                class="rhombus-icon"
            />
          </div>

          <div class="text__item">
            <span><b>Как добраться в Томск с запада?</b></span>
          </div>

          <div class="text__item">
            <span><b>Самолет</b> </span>
          </div>

          <div class="text__item">
            <span
            ><b>а)</b> Москва-Томск. Самый простой и дорогой вариант.
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>б)</b> Москва-Новосибирск (в пути 4 часа) > автобус
              Новосибирск-Томск. (в пути 4-5 часов) или поезд Новосибирск-Томск
              (в пути 5 часов). Расписание поезда уточняйте на сайте РЖД. Поезд
              будет более удобным вариантом, чем автобус</span
            >
          </div>

          <div class="text__item">
            <span
            ><b>с)</b> Москва-Кемерово (в пути 4 часа) > автобус
              Кемерово-Томск (в пути 4 часа). Личный совет: я всегда беру
              автобусные билеты на самый ближайший ко времени посадки рейс после
              посадки, но, так как самолет могут задержать, билеты я беру
              находясь в самолете за несколько минут до взлета</span
            >
          </div>

          <div class="text__item">
            <span><b>Поезд</b></span>
          </div>

          <div class="text__item">
            <span
            ><b>а)</b> ) Фирменный поезд Москва-Томск. Как правило, билеты на
              него дорогие и не всегда есть.</span
            >
          </div>

          <div class="text__item">
            <span
            ><b>б)</b> Поезд Москва-Тайга > электричка Тайга-Томск (в пути 2
              часа)</span
            >
          </div>

          <div class="text__item">
            <span
            ><b>с)</b> Поезд Москва-Юрга > автобус Юрга-Томск (в пути 1 час)
              <br />Поезд Москва-Юрга > автобус Юрга-Томск (в пути 1 час)
              <br />
              До Тайги и Юрги идет намного больше поездов, так как
              транссибирская магистраль проходит через эти населенные пункты,
              через Томск - нет. Если поедете через Тайгу, смотрите заранее
              расписание электричек, чтобы не пришлось ждать много часов
              следующего рейса. Билеты можно взять в кассе вокзала или в вагоне,
              но приготовьте наличку. Для любителей покрутить педали, из Юрги
              можно доехать на велосипеде. Расстояние около 100 километров.
              <br />Также, из Кемерово и Новосибирска в Томск можно добраться
              "блаблакаром", но нужно быть внимательным и уточнять у водителя на
              счет места для велосипеда. Доехать "блаблакаром" из Тайги можно,
              но это будет намного сложнее, не стоит на это рассчитывать.</span
            >
          </div>

          <br />

          <div class="text__item">
            <span
            ><b>Как добраться в Томск с востока?</b>
              <br />
              Для участников с востока, актуальным будет ЖД или автобусный
              транспорт, а также "блаблакар". Уточняйте рейсы из своего города.
              Если добираетесь по железной дороге и, например, нет билетов до
              Томска, рассматривайте варианты через город Тайга и далее на
              электричке до Томска или через город Юрга с пересадкой на автобус
              до Томска.
              <br />
              Для тех, кто не хочет отдавать велосипед в багаж или тащить его на
              себе, мы предлагаем заблаговременно отправить ваш велосипед нам
              транспортной компанией (рекомендуем СДЭК). Мы получим его и будем
              хранить до вашего приезда. Если вас интересует такой вариант,
              пожалуйста, сначала напишите нам. Контакты есть на сайте и в
              группе мероприятия.
            </span>
          </div>

          <br />

          <div class="text__item">
            <span><b>Где остановиться в Томске? Как выбрать?</b> </span>
          </div>

          <div class="text__item">
            <span
            ><b>1. Хостел Дом охотника. </b>Находится в центре города в
              памятнике деревянной архитектуры.
              <a href="https://hunter-hostel.ru/" target="_blank"
              >hunter-hostel.ru</a
              >
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>2. Гостница Академия. </b>. Находится в Академгородке на
              окраине города. В шаговой доступности находится трасса для
              даунхила и несколько мтб трейлов.
              <a href="http://akadem-otel.ru/prices" target="_blank"
              >akadem otel</a
              >
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>3. Гостиница Асти РУМС Томск. </b>
              Практически центр города, рядом главный Университет города ТГУ и
              ботанический сад, в шаговой доступности река Томь и исторический
              квартал с деревянной застройкой Татарская слобода, а также Томский
              пивоваренный завод.
              <a href="http://astirooms.ru/" target="_blank">astirooms</a>
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>4. Atlas hotel. </b>
              Находится в центре города, во дворе за Политехническим
              университетом. В шаговой доступности главная улица города,
              ботанический сад и Томский государственный университет.
              <a href="https://atlas-tomsk.ru/" target="_blank">atlas tomsk</a>
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>5. Домино Хостел. </b>
              Находится в центре города. Рядом все центральные
              достопримечательности.
              <a href="https://101hotels.com/main/cities/tomsk/domino_hostel_1.html" target="_blank"
              >domino tomsk</a
              >
            </span>
          </div>

          <div class="text__item">
            <span
            ><b>6. Хостел Русь Томск. </b>Находится в центре города. Рядом
              река, несколько баров и все центральные достопримечательности.
              <a href="https://hosteltomsk.ru/" target="_blank">hostel tomsk</a>
            </span>
          </div>

          <button class="btn-ok" @click="goToHome"/>
        </div>
      </div>

      <button
        class="content__btn-understand"
        @click="goToMainPage"
        @mouseover="isHover = !isHover"
        @mouseleave="isHover = !isHover"
      >
        <img
          :src="image"
          alt="btn-understand"
        />
      </button>
    </div>
  </div>
</template>

<style scoped lang="scss">
.details {
  background-image: url("../assets/images/details-bg.png");
  background-size: cover;
  background-repeat: no-repeat;
  background-position: center center;
  width: 100%;
  height: 100%;

  .content {
    margin: 0 auto;
    width: 80%;
    background-color: $white;
    -webkit-box-shadow: 1px 1px 15px 5px #000000;
    box-shadow: 1px 1px 15px 5px #000000;
    padding: 5em 0 40px 0;

    .wrapper {
      padding: 0 8%;
    }

    &__image {
      display: flex;
      justify-content: center;
      margin: 30px 0;

      .rhombus-icon {
        width: 50px;
        height: 50px;
        text-align: center;
      }
    }

    &__text {
      span {
        font-size: rem(16px);
      }

      a {
        color: $pink;
        font-weight: 600;
      }
    }

    &__btn-understand {
      margin: 0 auto;

      img {
        width: 250px;

        @media (max-width: 360px) {
          width: 200px;
        }

        @media (min-width: 768px) {
          width: 300px;
        }
      }
    }
  }

  .btn-link {
    color: $pink;
    font-weight: 600;
    background-color: transparent;
    border: none;
    cursor: pointer;
    outline: none;
  }

  .btn-ok {
    margin-top: rem(50px);
    color: $black !important;

    img {
      order: 1 !important;
    }

    span {
      order: 2 !important;
    }
  }
}
</style>
